# Estrae tutte le narrazioni che intersecano con il poligono delle alpi

PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?narra ?nlabel ?c1 ?label ?p1
FROM <urn:x-arq:UnionGraph>
WHERE { 
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
	} 
  	FILTER(geof:sfIntersects(?o1, "MULTIPOLYGON(((16.5637843 48.1385371,16.4786368 48.1483738,16.3474471 47.9914562,16.2083550 47.9229107,16.2247436 47.8719308,16.0807278 47.7254502,16.2313890 47.7302235,16.3486178 47.8186434,16.3981464 47.7085419,16.5913792 47.6654326,16.5769799 47.6190986,16.4073466 47.6045695,16.3840325 47.5620570,16.3768383 47.4986092,16.4941216 47.4677882,16.5300670 47.3446343,16.3735984 47.2829109,16.3807803 47.2306361,16.1720823 47.3090407,16.0949705 47.2434640,16.0210921 47.1604656,15.9892259 47.0523481,15.8237450 46.9422938,15.6499922 46.7057582,15.6574372 46.4676549,15.5638640 46.3831339,15.5768663 46.3049817,15.3999291 46.2107348,15.0920437 46.2580111,14.9978388 46.1572976,14.9092200 46.1566376,14.7022720 46.2607111,14.5360170 46.2480931,14.1263391 46.4103707,14.0854331 46.3456697,14.3449422 46.2439625,14.2888766 46.1754014,14.1694025 46.2243806,14.0208196 46.1908226,13.9758168 46.2151488,13.8613214 46.1521274,13.7405114 46.1517053,13.5892663 46.0429026,13.6540007 45.9803812,13.5414132 45.9360773,13.4621074 45.9773688,13.4472835 46.1023534,13.2579187 46.1638984,13.2242063 46.2180766,13.1571393 46.2374116,13.1199813 46.3082309,13.0066989 46.2040558,12.8993936 46.1771437,12.7837671 46.2173135,12.6626592 46.1721413,12.4641308 45.9744456,12.3218659 45.9889409,12.0614432 45.8885745,11.9732199 45.8046935,11.7306049 45.7789106,11.6905104 45.6692969,11.5497769 45.5492421,10.9947116 45.4264543,10.6467999 45.4148126,10.2229812 45.5398142,10.0724897 45.6268417,9.6981482 45.7051193,9.4820192 45.7108578,9.3938339 45.8469855,9.0817548 45.7915638,8.8303102 45.8498015,8.5946776 45.8281027,8.6034874 45.7264338,8.4721306 45.7297915,8.3594415 45.6490805,8.3676175 45.6212560,8.2294959 45.5674897,8.0709724 45.5759779,8.0071494 45.5484498,8.0177238 45.4872742,8.1128912 45.4485124,8.0963283 45.4163224,7.9544934 45.4728686,7.8618827 45.4663952,7.8740053 45.5163946,7.8344668 45.5279822,7.8135966 45.4377311,7.7213286 45.3773524,7.6856230 45.3927846,7.6243085 45.3373085,7.6416540 45.3180935,7.5776174 45.3056582,7.6506039 45.2961434,7.7673336 45.2011513,7.4911307 45.2710209,7.6327508 45.1462110,7.4533412 45.1494253,7.5213431 45.0977610,7.4840925 45.0729146,7.5191113 45.0742482,7.5102827 45.0502354,7.4312207 45.0339872,7.4617245 44.9961361,7.3922365 44.9837368,7.3375423 44.9268235,7.3561232 44.8982248,7.3036771 44.8800257,7.2886109 44.8077119,7.3694719 44.7140033,7.3908770 44.6595762,7.3654810 44.6345411,7.4916123 44.6443317,7.4651755 44.5111389,7.3804734 44.4767500,7.4299942 44.4197423,7.4050831 44.4081413,7.4742080 44.3747305,7.4567967 44.3322845,7.6801297 44.3189358,7.7240750 44.3653424,7.7663037 44.3334265,7.8902188 44.4414235,8.0663365 44.3708365,8.2585859 44.3672749,8.3817569 44.3234890,8.4538464 44.2675581,8.4251685 44.1955041,8.2702305 44.1400442,8.1632441 43.9924443,8.1737590 43.9546525,8.0727132 43.8910706,7.6728163 43.7756906,7.5217854 43.7846226,7.3381862 43.7121361,7.3312890 43.6747060,7.3164340 43.7065890,7.2451832 43.6899480,7.2127787 43.6477792,7.1363844 43.6362918,7.1384248 43.5459191,7.0969284 43.5710089,7.0383594 43.5351360,6.9627311 43.5420135,6.9238041 43.4506657,6.8553753 43.4112579,6.7263432 43.4105747,6.4888570 43.4990947,6.1851508 43.7245292,6.0566321 43.7073205,5.8973716 43.7586369,5.9531013 43.9916175,6.0140732 44.0379717,5.9078079 44.1161905,5.6077400 44.1640858,5.1727893 44.1455561,5.2215076 44.5329603,5.1856609 44.6250831,5.0455740 44.6618870,5.0718976 44.8804909,5.2366217 45.0556444,5.3380790 45.0201915,5.3542453 45.1028808,5.5409937 45.2737853,5.8093368 45.4524208,6.1313383 45.8982612,6.3029101 46.0255890,6.4639091 46.0647152,6.3828017 46.0880291,6.3600548 46.1608231,6.2947452 46.1902526,6.3402048 46.2577135,6.4456447 46.2854182,6.5574916 46.3967682,6.7176255 46.4077390,6.9229008 46.3703866,6.8975543 46.4496445,6.9485103 46.5863082,7.1100571 46.6044214,7.1090095 46.6764955,7.1846454 46.7239635,7.3008389 46.7220644,7.4679232 46.7806746,7.5143036 46.7239635,7.6236941 46.7109588,7.6534451 46.7848278,7.8528812 46.8137692,7.9496559 46.9095187,8.1131471 46.9926880,8.3516498 47.0308198,8.5025465 47.1253669,8.8458471 47.2141616,8.8909713 47.3391339,8.8651634 47.3530018,8.8933106 47.3657359,8.8612219 47.3810528,8.8532458 47.4701787,9.0333336 47.4032766,9.3994783 47.4112582,9.4782893 47.4899604,9.6460256 47.5259531,9.6810190 47.4918770,9.7457813 47.5056401,9.7351570 47.5465009,9.8043713 47.6210362,10.0028403 47.6134535,10.0738676 47.6649554,10.0731556 47.7580134,10.1392300 47.7787037,10.2378822 47.7325427,10.2747572 47.6803550,10.2695329 47.6122346,10.4324899 47.6539432,10.4534831 47.6203865,10.6416469 47.5691194,10.7297731 47.5950506,10.7399984 47.6530289,10.8272143 47.7172183,10.9267735 47.7289429,10.9826778 47.6765305,11.1289912 47.6410262,11.2962362 47.6841559,11.3302912 47.6439126,11.4088793 47.7413381,11.6663274 47.7684173,11.7558837 47.7396326,11.8897662 47.8058691,12.1011242 47.8450447,12.3121763 47.8014558,12.3564606 47.8226906,12.4576651 47.7651793,12.8154408 47.8427166,12.8817350 47.7733953,12.9951668 47.7649745,13.0575378 47.7230754,13.0828916 47.7318759,13.0760664 47.7831268,13.0061330 47.8504333,13.5057669 48.0232320,13.8075319 47.9904333,13.8151925 47.9490839,13.9498898 47.9605026,14.1236108 47.8670777,14.1967389 47.9487762,14.4607541 47.9158821,14.5944990 47.9334214,14.7362964 47.9927654,14.8536461 48.1179402,15.0112398 48.1154615,15.1258194 48.2095161,15.3486454 48.2435391,15.4030703 48.2859552,15.4111604 48.3567616,15.4978372 48.4091777,15.5317182 48.3840096,15.8504791 48.3796981,15.9420596 48.3399262,16.2858463 48.3514949,16.4129149 48.2228847,16.5637843 48.1385371)))"^^<http://www.opengis.net/ont/geosparql#wktLiteral>)). 
}


# Le narrazioni che intersecano in un buffer di 1 degree (circa 111 km)
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?narra ?nlabel ?c1 ?label ?p1 ?o1
FROM <urn:x-arq:UnionGraph>
WHERE { 
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
   
	} 
  
  	FILTER(geof:sfWithin(?o1, geof:buffer("POINT(7.3196649 45.7370885)"^^<http://www.opengis.net/ont/geosparql#wktLiteral>, 0.5, uom:degree))). 
}

# Le narrazioni dentro la scozia
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?narra ?nlabel ?c1 ?label ?p1 
FROM <urn:x-arq:UnionGraph>
WHERE { 
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
   
	} 
  
  	FILTER(geof:sfWithin(?o1,"MULTIPOLYGON(((-13.3609679 57.5937691,-13.3790062 57.5383964,-13.4029536 57.5104497,-13.4589098 57.4716370,-13.5186409 57.4466391,-13.5973257 57.4280040,-13.7179419 57.4213286,-13.8312423 57.4387502,-13.9280519 57.4774823,-13.9907770 57.5300031,-14.0093834 57.5630608,-14.0155170 57.6026322,-14.0050493 57.6415005,-13.9826738 57.6735942,-13.9154239 57.7234245,-13.8222112 57.7573180,-13.7597622 57.7688016,-13.6742834 57.7730825,-13.5378970 57.7533487,-13.4562264 57.7206920,-13.4153067 57.6938093,-13.3867608 57.6656993,-13.3645916 57.6236762,-13.3609679 57.5937691)),((-8.1022246 57.8730000,-8.1074568 57.8350000,-8.1311594 57.7910000,-8.1437625 57.7430000,-8.1661968 57.7100000,-8.1998228 57.6790000,-8.2541699 57.6460000,-8.3170501 57.6210000,-8.3911813 57.6030000,-8.4704675 57.5940000,-8.6645120 57.6030000,-8.7447543 57.6210000,-8.8390500 57.6520000,-8.9244355 57.6940000,-8.9737348 57.7300000,-9.0092046 57.7750000,-9.0232244 57.8230000,-9.0167775 57.8670000,-8.9931348 57.9090000,-8.9579949 57.9450000,-8.9088433 57.9770000,-8.8509756 58.0020000,-8.7614339 58.0250000,-8.6707912 58.0600000,-8.5331216 58.0820000,-8.4554780 58.0820000,-8.3755826 58.0730000,-8.3041793 58.0560000,-8.2398620 58.0310000,-8.1823065 57.9960000,-8.1410834 57.9590000,-8.1124241 57.9150000,-8.1022246 57.8730000)),((-0.3577917 60.8600000,-0.3491390 60.8280000,-0.3505648 60.7980000,-0.3740585 60.7480000,-0.3784529 60.7180000,-0.3920742 60.6870000,-0.3663498 60.6460000,-0.3572927 60.6100000,-0.3622043 60.5720000,-0.3822503 60.5315345,-0.3423369 60.4900662,-0.3233254 60.4478241,-0.3219092 60.4116939,-0.3339684 60.3753963,-0.3589880 60.3410757,-0.3972256 60.3080157,-0.4749453 60.2664945,-0.5410778 60.2112358,-0.6086695 60.1794774,-0.6051880 60.1270000,-0.6298920 60.0700000,-0.6793442 60.0230000,-0.7691942 59.9720000,-0.8002315 59.9150000,-0.8630005 59.8650000,-0.8894762 59.8010000,-0.9190254 59.7630000,-0.9799298 59.7190000,-1.0607220 59.6850000,-1.1553189 59.6630000,-1.2634363 59.6540000,-1.2280219 59.6150000,-1.2061389 59.5710000,-1.2020029 59.5310000,-1.2137797 59.4890000,-1.2385222 59.4520000,-1.2837980 59.4100000,-1.3505053 59.3710000,-1.4072485 59.3470000,-1.5609530 59.3130000,-1.7184387 59.3110000,-1.7950038 59.3220000,-1.8638306 59.3400000,-1.9254659 59.3650000,-1.9787836 59.3970000,-1.9803199 59.3630000,-1.9928797 59.3300000,-1.9825411 59.2980000,-1.9823523 59.2640000,-2.0051371 59.2090000,-2.0588275 59.1580000,-2.1385696 59.1170000,-2.1418753 59.0600000,-2.1873162 58.9740000,-2.2201544 58.9340000,-2.2681322 58.8990000,-2.2843266 58.8540000,-2.3184847 58.8120000,-2.3978199 58.7550000,-2.5088222 58.7129022,-2.5081356 58.6576399,-2.5340565 58.6069758,-2.5828083 58.5625062,-2.6727000 58.5160000,-2.6641402 58.4700000,-2.6770365 58.4120000,-2.7655964 58.2850000,-2.8098689 58.2480000,-2.9384953 58.1700000,-3.0257475 58.1340000,-3.1350635 58.1080000,-3.2021399 58.0540000,-3.2541721 58.0236106,-3.1579195 57.9135942,-3.0547803 57.8850000,-2.9532868 57.9010000,-2.8476449 57.9060000,-2.4686728 57.8750000,-2.3528002 57.8930000,-2.2249645 57.8930000,-2.1245237 57.9010000,-1.9519434 57.8980000,-1.8339545 57.8780000,-1.7306375 57.8480000,-1.6679488 57.8230000,-1.5108078 57.7220000,-1.4652548 57.6680000,-1.4497372 57.6170000,-1.4053145 57.5560000,-1.3932676 57.5100000,-1.4066704 57.4340000,-1.4374942 57.3840000,-1.5531247 57.2780000,-1.6694678 57.2050000,-1.6863921 57.1850000,-1.6780042 57.1330000,-1.6931230 57.0770000,-1.7606417 56.9830000,-1.8233605 56.9260000,-1.8414457 56.8610000,-1.8784476 56.8030000,-1.9243347 56.7560000,-2.0079062 56.6910000,-2.0845672 56.6440000,-2.1288861 56.5730702,-2.0852842 56.5435548,-2.0504369 56.5065335,-2.0300092 56.4653035,-2.0265760 56.4176676,-2.0356740 56.3868907,-2.0626249 56.3452454,-2.1112050 56.3042213,-2.1642484 56.2758307,-1.9816654 56.0966417,-1.9124754 56.0720000,-1.8572233 56.0410000,-1.7668899 55.9720000,-1.7266758 55.9170000,-1.7999328 55.8908028,-1.9707422 55.8444169,-2.0456042 55.8053235,-2.0861144 55.7930487,-2.0856300 55.7620410,-2.1073497 55.7600775,-2.1064354 55.7485668,-2.1157134 55.7475601,-2.1177782 55.7386818,-2.1440109 55.7393520,-2.1505675 55.7231574,-2.1765118 55.7188405,-2.1672228 55.7060380,-2.1840473 55.7015960,-2.2186520 55.6759090,-2.2184456 55.6642619,-2.2483391 55.6521513,-2.2319107 55.6451463,-2.2347923 55.6408135,-2.2997979 55.6472184,-2.3251657 55.6429163,-2.3360923 55.6321717,-2.3243044 55.6261649,-2.3086250 55.6288487,-2.3089284 55.6224784,-2.3161248 55.6204531,-2.2891917 55.6037978,-2.2888713 55.5803574,-2.2406588 55.5559173,-2.2322416 55.5448277,-2.2332211 55.5296168,-2.2242761 55.5227852,-2.2289649 55.5098016,-2.2026417 55.4895407,-2.2063475 55.4815591,-2.2015841 55.4755153,-2.1655133 55.4683810,-2.1880702 55.4621144,-2.1948503 55.4445892,-2.2312743 55.4284280,-2.2607256 55.4328629,-2.3133057 55.4067251,-2.3356954 55.4081767,-2.3335235 55.4024239,-2.3449422 55.3993326,-2.3300134 55.3812399,-2.3461212 55.3732848,-2.3375229 55.3671867,-2.3789001 55.3491641,-2.3983701 55.3478272,-2.4152482 55.3589200,-2.4765364 55.3546203,-2.4907751 55.3505745,-2.5209922 55.3224974,-2.5591654 55.3176688,-2.5570840 55.3116046,-2.5733573 55.2968796,-2.6091582 55.2833117,-2.6281852 55.2679276,-2.6266278 55.2622249,-2.6468899 55.2600626,-2.6114758 55.2472873,-2.6302227 55.2448500,-2.6357999 55.2297607,-2.6314084 55.2236928,-2.6668507 55.2216005,-2.7052923 55.1723699,-2.7329677 55.1671090,-2.7907102 55.1398629,-2.8254995 55.1383077,-2.8330529 55.1324465,-2.8276049 55.1248328,-2.8415164 55.1223183,-2.8379140 55.1173441,-2.8448664 55.1115817,-2.8707328 55.1063357,-2.8768698 55.0951944,-2.8864242 55.0946471,-2.8840499 55.0873198,-2.8935184 55.0876470,-2.8968765 55.0779448,-2.9151232 55.0789297,-2.9391202 55.0698485,-2.9431270 55.0645623,-2.9372908 55.0599015,-2.9586935 55.0492688,-3.0510494 55.0527308,-3.0534170 55.0472789,-3.0433853 55.0473689,-3.0260851 55.0354138,-3.0343126 55.0299027,-3.0302351 55.0246405,-3.0406388 55.0224939,-3.0391645 55.0164756,-3.0494540 55.0093895,-3.0441743 54.9984318,-3.0576729 54.9917750,-3.0560953 54.9857223,-3.0715859 54.9817548,-3.0723503 54.9691622,-3.1202330 54.9730531,-3.1507154 54.9495321,-3.2002242 54.9633335,-3.2966073 54.9632802,-3.3196122 54.9583971,-3.3480289 54.9395050,-3.4666240 54.9095070,-3.5410555 54.8197944,-3.6379863 54.7789647,-3.8693401 54.6156477,-4.0537584 54.5309332,-4.0748658 54.5001033,-4.1534690 54.5506519,-4.2928961 54.5509279,-4.4003826 54.5464826,-4.5325878 54.5295386,-4.6725693 54.4995405,-4.8685550 54.4339831,-4.9629634 54.4400000,-5.0777816 54.4645486,-5.1816610 54.5659244,-5.2124918 54.6061971,-5.2447119 54.6634122,-5.2491571 54.7006300,-5.2602673 54.7139616,-5.3283164 54.7770090,-5.4366389 54.8569985,-5.4633041 54.9150468,-5.5344090 54.9958699,-5.6141229 55.0466964,-5.7402195 55.0875237,-5.8124343 55.1391836,-5.8482645 55.1827891,-5.8810391 55.2113965,-5.9440881 55.2555574,-6.0085253 55.2855532,-6.0354674 55.3188823,-6.0640757 55.3422126,-6.1237912 55.3716530,-6.2554424 55.4102583,-6.3670954 55.4258111,-6.4998564 55.4299761,-6.5787357 55.4435849,-6.7471094 55.5200000,-6.8009100 55.5530000,-6.8575377 55.6120797,-6.8820376 55.6552984,-6.9677946 56.0197571,-7.1502303 56.0905465,-7.2477505 56.0944679,-7.3414542 56.1134241,-7.4035762 56.1366853,-7.4518610 56.1639097,-7.4871742 56.1927164,-7.5176423 56.2327744,-7.5315878 56.2724195,-7.5315554 56.3092698,-7.9643470 56.6757753,-8.0097453 56.7300000,-8.0303219 56.7950000,-8.0173354 56.8590000,-8.0009709 56.8918215,-7.8859332 57.0612197,-7.8442708 57.2105490,-8.0652450 57.4503136,-8.0959216 57.4970774,-8.1042675 57.5464713,-8.0948678 57.6949480,-8.0709265 57.7550000,-8.0201734 57.8079455,-7.6400315 58.0748074,-7.7777815 58.0930000,-7.8681370 58.1170000,-7.9485413 58.1560000,-8.0043415 58.2050000,-8.0322221 58.2630000,-8.0335273 58.2930000,-8.0261811 58.3230000,-7.9878123 58.3780000,-7.9190241 58.4260000,-7.8537199 58.4540000,-7.7769785 58.4740000,-7.5842989 58.4900000,-7.4811327 58.4840000,-7.3948631 58.4690000,-7.3185389 58.4440000,-7.2478567 58.4070000,-7.1499319 58.4454529,-7.0415847 58.4750002,-6.9751591 58.4865017,-6.4787416 58.6830000,-6.3281346 58.7161537,-5.0442120 58.8260000,-4.8045669 58.8150000,-4.6602243 58.7970000,-4.5852500 58.7810000,-4.4725732 58.7780000,-4.2746229 58.7590000,-4.1731574 58.7860000,-4.0989904 58.7980000,-3.9829685 58.8010000,-3.8729903 58.7870000,-3.8012260 58.8070000,-3.8201315 58.8590000,-3.8184849 58.9050000,-3.7859932 58.9700000,-3.7547466 59.0070000,-3.7414381 59.0750000,-3.7428033 59.1290000,-3.7064736 59.2050000,-3.6681274 59.2450000,-3.6112462 59.2810000,-3.5440082 59.3080000,-3.4621200 59.3280000,-3.4545208 59.3720000,-3.4290498 59.4130000,-3.3858159 59.4510000,-3.3263499 59.4840000,-3.0501626 59.5670000,-2.9700648 59.5810000,-2.8873866 59.5860000,-2.7672255 59.5780000,-2.6523063 59.5510000,-2.5841813 59.5700000,-2.4891666 59.5860000,-2.3891812 59.5920000,-2.3006322 59.5880000,-2.1624531 59.5590000,-2.1039403 59.5350000,-2.0517401 59.5040000,-2.0515850 59.5420000,-2.0374129 59.5790000,-2.0003294 59.6350000,-1.9532266 59.6750000,-1.8856081 59.7100000,-1.8339355 59.7266886,-1.7542348 59.7442572,-1.6736123 59.7529494,-1.7376022 59.7980957,-1.7742787 59.8468989,-1.7875814 59.8848353,-1.7909219 59.9160009,-1.7760960 59.9708061,-1.8648821 59.9360000,-1.9733245 59.9150000,-2.1034923 59.9110000,-2.2054598 59.9230000,-2.3063977 59.9510000,-2.4226159 60.0060000,-2.4822345 60.0540000,-2.5126457 60.1080000,-2.5178935 60.1420000,-2.5129111 60.1740000,-2.4971405 60.2060000,-2.4723235 60.2350000,-2.4235240 60.2720000,-2.3552357 60.3066973,-2.2298156 60.3448254,-2.2325579 60.3709790,-2.2268113 60.4020523,-2.1942860 60.4529943,-2.1221882 60.5081410,-2.0163633 60.5507878,-1.9838077 60.6175006,-1.9185978 60.6737339,-1.8626362 60.7018033,-1.7822128 60.7277855,-1.7326671 60.7633922,-1.6683155 60.7930691,-1.4538246 60.8526123,-1.3756329 60.8945565,-1.2791699 60.9236565,-1.2260922 60.9700000,-1.1472897 61.0100000,-1.0636747 61.0380000,-0.9721289 61.0550000,-0.8770489 61.0610000,-0.8001724 61.0580000,-0.7199560 61.0470000,-0.6447966 61.0280000,-0.5133889 60.9820000,-0.4432766 60.9460000,-0.3902380 60.9060000,-0.3577917 60.8600000)),((-5.4196790 59.1170000,-5.4322622 59.0650000,-5.4694869 59.0170000,-5.5301510 58.9750000,-5.6081412 58.9430000,-5.6883425 58.9240000,-5.7706523 58.9150000,-5.9384420 58.9230000,-6.0427271 58.8970000,-6.1530746 58.8880000,-6.2364050 58.8920000,-6.3066083 58.9030000,-6.3756750 58.9220000,-6.4365018 58.9480000,-6.4898752 58.9830000,-6.5304142 59.0260000,-6.5527205 59.0640000,-6.5600264 59.1020000,-6.5479351 59.1520000,-6.5116398 59.1990000,-6.4530375 59.2400000,-6.3762581 59.2720000,-6.3038559 59.2900000,-6.2258424 59.3000000,-6.0608981 59.2950000,-5.9543448 59.3240000,-5.8313334 59.3350000,-5.7457344 59.3310000,-5.6704123 59.3190000,-5.5999668 59.2990000,-5.5361355 59.2710000,-5.4883807 59.2400000,-5.4536881 59.2050000,-5.4280904 59.1610000,-5.4196790 59.1170000)),((-4.0110607 59.0970000,-4.0144327 59.0610000,-4.0315305 59.0240000,-4.0600471 58.9910000,-4.1019720 58.9590000,-4.2717048 58.8640000,-4.3504938 58.8400000,-4.4398899 58.8260000,-4.5118818 58.8230000,-4.6013085 58.8290000,-4.6799332 58.8440000,-4.7520458 58.8680000,-4.8098060 58.8980000,-4.8545516 58.9340000,-4.8837903 58.9740000,-4.8963007 59.0170000,-4.8890277 59.0650000,-4.8587482 59.1120000,-4.8217685 59.1440000,-4.7589916 59.1790000,-4.7149886 59.2140000,-4.6097072 59.2610000,-4.4780294 59.2860000,-4.4053620 59.2890000,-4.3050233 59.2820000,-4.2258796 59.2670000,-4.1582813 59.2450000,-4.0987150 59.2150000,-4.0528864 59.1790000,-4.0233066 59.1390000,-4.0110607 59.0970000)))"^^<http://www.opengis.net/ont/geosparql#wktLiteral>)). 
}


# Le narrazioni che intersecano in un buffer di 1 degree (circa 111 km)
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX osmrel: <https://www.openstreetmap.org/relation/>
PREFIX schema: <http://schema.org/>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT * 
FROM <urn:x-arq:UnionGraph>
WHERE  
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .

    
  
  	FILTER(geof:sfWithin(?o1,?hasgeometry)). 
  {SELECT ?hasgeometry WHERE {
   SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> { 
      ?osm_id osm:wikidata wd:Q22 .
      ?osm_id geo:hasGeometry ?hasgeometry .
      ?osm_id a <https://www.openstreetmap.org/relation> .
      } }LIMIT 1}
}

# Le narrazioni che intersecano in un buffer di 1 degree (circa 111 km)
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX osmrel: <https://www.openstreetmap.org/relation/>
PREFIX schema: <http://schema.org/>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT * 
FROM <urn:x-arq:UnionGraph>
WHERE  
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
  
  	FILTER(geof:sfWithin(?o1,?hasgeometry)). 
  {SELECT ?hasgeometry WHERE {
   SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> { 
      ?osm_id osm:wikidata wd:Q1653 .
      ?osm_id geo:hasGeometry ?hasgeometry .
      ?osm_id a <https://www.openstreetmap.org/relation> .
      } }}
}

# Le narrazioni che intersecano in un buffer di 1 degree (circa 111 km) dal danubio
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?narra ?nlabel ?c1 ?label ?p1 ?o1
FROM <urn:x-arq:UnionGraph>
WHERE { 
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
   
	} 
  
  	FILTER(geof:sfIntersects(?o1, geof:buffer("MULTILINESTRING ((17.206445312500023 48.06110260624412, 17.242919921875 48.04132721561912, 17.256494140625023 48.02809479374412, 17.26171875 48.00929596561912, 17.272216796875 48.00556061405662, 17.33740234375 47.99896881718162, 17.369042968750023 47.98146393436912, 17.471435546875 47.88910553593162, 17.4814453125 47.882928778119116, 17.49169921875 47.88007233280662, 17.516845703125 47.87653229374412, 17.526123046875 47.87238190311912, 17.559814453125 47.838251043744116, 17.572021484375 47.82977936405662, 17.582421875000023 47.83002350468162, 17.592529296875 47.83344147343162, 17.603759765625 47.83449127811912, 17.618554687500023 47.82953522343162, 17.639404296875 47.819452215619116, 17.657861328125023 47.80756256718162, 17.665771484375 47.79730866093162, 17.676025390625 47.789422918744116, 17.741455078125 47.76564362186912, 17.8251953125 47.75026276249412, 18.112207031250023 47.76271393436912, 18.2353515625 47.75416901249412, 18.2724609375 47.756463934369116, 18.347314453125023 47.776971746869116, 18.552001953125 47.79315827030662, 18.596923828125 47.790887762494116, 18.63330078125 47.78009674686912, 18.6630859375 47.77619049686912, 18.6923828125 47.778192449994116, 18.716699218750023 47.78834869999412, 18.749755859375 47.813836981244116, 18.76708984375 47.82257721561912, 18.789794921875 47.82660553593162, 18.882226562500023 47.82594635624412, 18.898095703125023 47.82379791874412, 18.9111328125 47.81959869999412, 18.915283203125 47.81586334843162, 18.922753906250023 47.80597565311912, 18.927880859375023 47.80280182499412, 18.948486328125 47.803094793744116, 19.013818359375023 47.828973699994116, 19.0390625 47.830438543744116, 19.063232421875 47.82648346561912, 19.0859375 47.81720612186912, 19.106835937500023 47.802850653119116, 19.123046875 47.77545807499412, 19.128320312500023 47.73639557499412, 19.1240234375 47.69342682499412, 19.111962890625023 47.65412018436912, 19.054443359375 47.540399481244116, 19.050537109375 47.50617096561912, 19.0537109375 47.496698309369116, 19.062255859375 47.48541901249412, 19.064208984375 47.47821686405662, 19.062255859375 47.46845123905662, 19.052734375 47.45404694218162, 19.050537109375 47.44782135624412, 19.046777343750023 47.42555573124412, 19.036376953125 47.41254303593162, 19.002099609375023 47.39630768436912, 18.974365234375 47.37946198124412, 18.952539062500023 47.35700104374412, 18.934960937500023 47.328485418744116, 18.920166015625 47.29328034061912, 18.907617187500023 47.23749420780662, 18.886962890625 47.20819733280662, 18.88134765625 47.18964264530662, 18.87890625 47.16901276249412, 18.879150390625 47.14923737186912, 18.88916015625 47.11041901249412, 18.896875 47.09027741093162, 18.903076171875 47.08161041874412, 18.918701171875 47.07404205936912, 18.968017578125 47.03322174686912, 18.966699218750023 47.02374909061912, 18.962060546875023 47.017206121869116, 18.956933593750023 47.01173737186912, 18.954345703125 47.00531647343162, 18.955078125 46.994745184369116, 18.96044921875 46.97748444218162, 18.966943359375023 46.93585846561912, 18.966552734375 46.91730377811912, 18.9580078125 46.909051824994116, 18.948876953125023 46.903924871869116, 18.93896484375 46.89179108280662, 18.930908203125 46.87721588749412, 18.927490234375 46.86500885624412, 18.926025390625 46.83527252811912, 18.927490234375 46.82716705936912, 18.93310546875 46.82057526249412, 18.950585937500023 46.80714752811912, 18.954345703125 46.80353424686912, 18.958398437500023 46.80084869999412, 18.975341796875 46.78400299686912, 18.978515625 46.77997467655662, 18.984765625000023 46.77565338749412, 18.98681640625 46.765497137494116, 18.987548828125 46.75397369999412, 18.989013671875 46.74518463749412, 18.998925781250023 46.72321198124412, 19.001708984375 46.70851471561912, 18.996337890625 46.69489166874412, 18.981591796875023 46.67633698124412, 18.952880859375 46.65619537968162, 18.88525390625 46.63532135624412, 18.858154296875 46.614862371869116, 18.877197265625 46.591180731244116, 18.907617187500023 46.53180573124412, 18.920166015625 46.49884674686912, 18.922753906250023 46.46869537968162, 18.89892578125 46.41437409061912, 18.892236328125023 46.37843659061912, 18.8955078125 46.362909246869116, 18.910058593750023 46.34296295780662, 18.913330078125 46.33063385624412, 18.914941406250023 46.19525787968162, 18.903564453125 46.17304108280662, 18.872314453125 46.183465887494116, 18.8251953125 46.14154694218162, 18.813378906250023 46.12616608280662, 18.794091796875023 46.11671784061912, 18.789794921875 46.11151764530662, 18.78515625 46.11225006718162, 18.775146484375 46.10297272343162, 18.762451171875 46.087274481244116, 18.700341796875023 46.044794012494116, 18.691650390625 46.01850006718162, 18.721582031250023 45.98493073124412, 18.80615234375 45.92360260624412, 18.831445312500023 45.89552643436912, 18.832421875000023 45.89105866093162, 18.83056640625 45.879510809369116, 18.831445312500023 45.87506744999412, 18.835205078125 45.87348053593162, 18.84130859375 45.87396881718162, 18.847412109375 45.873163153119116, 18.851953125000023 45.86818268436912, 18.853906250000023 45.859247137494116, 18.851953125000023 45.83034088749412, 18.849853515625 45.82448151249412, 18.84619140625 45.82025787968162, 18.844482421875 45.81593659061912, 18.84814453125 45.80983307499412, 18.863525390625 45.79877350468162, 18.87060546875 45.79022858280662, 18.899658203125 45.76515534061912, 18.904296875 45.75006744999412, 18.908447265625 45.71967194218162, 18.916748046875 45.70685455936912, 18.930419921875 45.699090887494116, 18.947656250000023 45.69232819218162, 18.962060546875023 45.68329498905662, 18.968017578125 45.66896393436912, 18.96240234375 45.66034577030662, 18.934814453125 45.63361237186912, 18.923828125 45.62799713749412, 18.911865234375 45.61945221561912, 18.90771484375 45.60065338749412, 18.906494140625 45.581903387494116, 18.903076171875 45.57330963749412, 18.911523437500023 45.56842682499412, 18.931542968750023 45.545770574994116, 18.941308593750023 45.53925202030662, 18.959619140625023 45.53937409061912, 18.97265625 45.546502996869116, 18.982666015625 45.55499909061912, 19.000146484375023 45.56146881718162, 19.008691406250023 45.56574127811912, 19.017578125 45.56757233280662, 19.026611328125 45.56281159061912, 19.03271484375 45.55487702030662, 19.035888671875 45.54975006718162, 19.040283203125 45.545282293744116, 19.050537109375 45.53925202030662, 19.067285156250023 45.53363678593162, 19.081787109375 45.53143952030662, 19.094482421875 45.52631256718162, 19.105712890625 45.51190827030662, 19.076562500000023 45.49188873905662, 19.009033203125 45.498895574994116, 18.995849609375 45.47406647343162, 19.00244140625 45.45558502811912, 19.031005859375 45.434198309369116, 19.036767578125023 45.42255280155662, 19.028076171875 45.41242096561912, 18.975341796875 45.39520905155662, 18.98828125 45.37946198124412, 19.003173828125 45.36640045780662, 19.0205078125 45.35748932499412, 19.040185546875023 45.35426666874412, 19.08154296875 45.35426666874412, 19.09130859375 45.35028717655662, 19.0947265625 45.34076569218162, 19.095703125 45.32941315311912, 19.098291015625023 45.32013580936912, 19.124267578125 45.29840729374412, 19.161523437500023 45.285272528119116, 19.362695312500023 45.24848053593162, 19.40673828125 45.24896881718162, 19.490869140625023 45.264276434369116, 19.529541015625 45.26686432499412, 19.5576171875 45.25580475468162, 19.571679687500023 45.23659088749412, 19.580468750000023 45.23078034061912, 19.598535156250023 45.22785065311912, 19.658105468750023 45.23444244999412, 19.698486328125 45.246698309369116, 19.741943359375 45.24506256718162, 19.784912109375 45.23749420780662, 19.810791015625 45.22785065311912, 19.817041015625023 45.23170807499412, 19.831689453125023 45.238153387494116, 19.838134765625 45.24213287968162, 19.846582031250023 45.25055573124412, 19.855615234375023 45.26508209843162, 19.862451171875023 45.272821356244116, 19.880859375 45.28229401249412, 19.898583984375023 45.27936432499412, 19.914306640625 45.268915106244116, 19.927490234375 45.25580475468162, 19.949365234375023 45.21869537968162, 19.965576171875 45.19855377811912, 19.985595703125 45.18976471561912, 20.042382812500023 45.17775299686912, 20.064697265625 45.17548248905662, 20.184960937500023 45.18500397343162, 20.222412109375 45.17548248905662, 20.256982421875023 45.15675690311912, 20.289453125000023 45.13226959843162, 20.345849609375023 45.07306549686912, 20.35693359375 45.03449127811912, 20.333251953125 45.01056549686912, 20.303955078125 44.99396393436912, 20.298095703125 44.97748444218162, 20.290673828125023 44.97748444218162, 20.30322265625 44.95465729374412, 20.31884765625 44.93439362186912, 20.396875 44.86456940311912, 20.408447265625 44.857049871869116, 20.455078125 44.84027741093162, 20.51416015625 44.83685944218162, 20.5458984375 44.83978912968162, 20.580322265625 44.85736725468162, 20.594970703125 44.85797760624412, 20.623681640625023 44.854608465619116, 20.636376953125023 44.84943268436912, 20.638574218750023 44.83734772343162, 20.628173828125 44.78859284061912, 20.6279296875 44.77704498905662, 20.63330078125 44.76520416874412, 20.644433593750023 44.75580475468162, 20.671875 44.74396393436912, 20.684814453125 44.733514715619116, 20.720361328125023 44.69623444218162, 20.741943359375 44.67921784061912, 20.763671875 44.66840241093162, 20.826416015625 44.66095612186912, 20.883203125000023 44.67267487186912, 20.989501953125 44.71681549686912, 21.077783203125023 44.72650787968162, 21.102783203125 44.74066803593162, 21.112207031250023 44.74481842655662, 21.125634765625023 44.74562409061912, 21.15087890625 44.74408600468162, 21.163818359375 44.74787018436912, 21.172265625000023 44.75690338749412, 21.179443359375 44.76808502811912, 21.188867187500023 44.77826569218162, 21.222412109375 44.79669830936912, 21.269433593750023 44.81366608280662, 21.319091796875 44.825067449994116, 21.360107421875 44.82667877811912, 21.3779296875 44.81691315311912, 21.395263671875 44.79047272343162, 21.41162109375 44.78510162968162, 21.49658203125 44.77826569218162, 21.557861328125 44.781854559369116, 21.577539062500023 44.77789948124412, 21.594970703125 44.76618073124412, 21.603662109375023 44.75031159061912, 21.609765625000023 44.73219635624412, 21.619140625 44.71417877811912, 21.655664062500023 44.68793366093162, 21.70458984375 44.67726471561912, 21.75625 44.67750885624412, 21.801171875000023 44.68414948124412, 21.837792968750023 44.695428778119116, 21.85498046875 44.69874909061912, 21.871484375000023 44.69623444218162, 21.961816406250023 44.66254303593162, 21.993798828125023 44.658807684369116, 22.003808593750023 44.651727606244116, 22.031640625000023 44.60358307499412, 22.039306640625 44.57709381718162, 22.044677734375 44.56940338749412, 22.05517578125 44.562372137494116, 22.066552734375023 44.557489324994116, 22.07568359375 44.55097077030662, 22.08642578125 44.52204010624412, 22.103759765625 44.509881903119116, 22.126123046875023 44.50294830936912, 22.147705078125 44.50116608280662, 22.171630859375 44.50563385624412, 22.1845703125 44.51539948124412, 22.298486328125023 44.66193268436912, 22.304443359375 44.677606512494116, 22.319238281250023 44.68561432499412, 22.360595703125 44.69232819218162, 22.380029296875023 44.70075104374412, 22.414941406250023 44.72809479374412, 22.425537109375 44.73390534061912, 22.450097656250023 44.73322174686912, 22.468408203125023 44.73041412968162, 22.483154296875 44.724237371869116, 22.552734375 44.66945221561912, 22.5869140625 44.64960358280662, 22.62060546875 44.63771393436912, 22.699462890625 44.63087799686912, 22.714257812500023 44.62335846561912, 22.764794921875023 44.58307526249412, 22.7587890625 44.56488678593162, 22.741113281250023 44.552118231244116, 22.718896484375023 44.54462311405662, 22.699462890625 44.542108465619116, 22.677978515625 44.54572174686912, 22.641503906250023 44.56329987186912, 22.62060546875 44.56940338749412, 22.599755859375023 44.57008698124412, 22.579833984375 44.56574127811912, 22.565087890625023 44.55573151249412, 22.559326171875 44.53900787968162, 22.55615234375 44.52167389530662, 22.5478515625 44.51198151249412, 22.534912109375 44.50775787968162, 22.499902343750023 44.50665924686912, 22.490478515625 44.50446198124412, 22.483544921875023 44.50001862186912, 22.479248046875 44.49066803593162, 22.4765625 44.47724030155662, 22.476464843750023 44.46417877811912, 22.4794921875 44.45607330936912, 22.50048828125 44.44215729374412, 22.5048828125 44.43524811405662, 22.505859375 44.42780182499412, 22.50341796875 44.41193268436912, 22.504638671875 44.40431549686912, 22.522216796875 44.37531159061912, 22.548730468750023 44.349237371869116, 22.582275390625 44.32868073124412, 22.62060546875 44.31622955936912, 22.662011718750023 44.31195709843162, 22.681054687500023 44.305536199994116, 22.68896484375 44.29193756718162, 22.684716796875023 44.24391510624412, 22.690087890625023 44.22919342655662, 22.905908203125023 44.12311432499412, 22.942138671875 44.11176178593162, 22.987548828125 44.10724518436912, 23.030517578125 44.09332916874412, 23.03955078125 44.062616278119116, 23.0224609375 44.031854559369116, 22.987548828125 44.01788971561912, 22.965722656250023 44.015741278119116, 22.926025390625 44.00641510624412, 22.9052734375 44.00421784061912, 22.885400390625023 43.994745184369116, 22.874169921875023 43.972284246869116, 22.85 43.89723541874412, 22.850488281250023 43.87457916874412, 22.862939453125023 43.85565827030662, 22.88818359375 43.83978912968162, 22.919091796875023 43.83449127811912, 23.13134765625 43.84821198124412, 23.161376953125 43.85761139530662, 23.196435546875023 43.86298248905662, 23.23388671875 43.87750885624412, 23.326416015625 43.88703034061912, 23.319580078125 43.88703034061912, 23.484130859375 43.88080475468162, 23.592041015625 43.83766510624412, 23.635498046875 43.832391668744116, 23.72021484375 43.846063543744116, 23.7421875 43.84296295780662, 23.799462890625023 43.818719793744116, 24.158837890625023 43.75319244999412, 24.357666015625 43.76027252811912, 24.374902343750023 43.76410553593162, 24.430566406250023 43.79437897343162, 24.465722656250023 43.80267975468162, 24.499658203125023 43.79975006718162, 24.705078125 43.74396393436912, 24.752099609375023 43.73908112186912, 24.963134765625 43.749872137494116, 25.0810546875 43.71918366093162, 25.210693359375 43.71210358280662, 25.251855468750023 43.70490143436912, 25.288183593750006 43.68927643436912, 25.322363281250006 43.66994049686912, 25.358984375 43.65448639530662, 25.402587890625 43.65033600468162, 25.425390625 43.65460846561912, 25.466894531250006 43.66798737186912, 25.48828125 43.670770574994116, 25.533300781250006 43.66896393436912, 25.556054687500023 43.67067291874412, 25.574609375000023 43.677606512494116, 25.593359375 43.68092682499412, 25.615966796875 43.68800690311912, 25.637451171875 43.69757721561912, 25.653076171875 43.70831940311912, 25.6708984375 43.71759674686912, 25.739013671875 43.71918366093162, 25.780517578125 43.73224518436912, 25.803955078125 43.76019928593162, 25.805761718750006 43.76393463749412, 25.838769531250023 43.78864166874412, 25.86875 43.801141668744116, 25.916015625 43.844598699994116, 25.924072265625 43.85890534061912, 25.933496093750023 43.87055084843162, 26.0537109375 43.93458893436912, 26.061132812500006 43.95001862186912, 26.078857421875 43.96925690311912, 26.11572265625 43.99909088749412, 26.150146484375 44.01271393436912, 26.230859375000023 44.02777741093162, 26.309960937500023 44.052850653119116, 26.613671875000023 44.08515045780662, 26.647216796875 44.093622137494116, 26.667236328125 44.095331121869116, 26.676855468750006 44.09735748905662, 26.69677734375 44.106317449994116, 26.708251953125 44.10834381718162, 26.753173828125 44.10834381718162, 26.788964843750023 44.11622955936912, 26.883544921875 44.15680573124412, 27.001074218750006 44.16535065311912, 27.026953125 44.17731354374412, 27.099609375 44.14472077030662, 27.204980468750023 44.12946198124412, 27.226171875 44.12091705936912, 27.2666015625 44.13776276249412, 27.292236328125 44.15143463749412, 27.444726562500023 44.13397858280662, 27.461035156250006 44.13764069218162, 27.48164062500001 44.14569733280662, 27.499267578125 44.15578034061912, 27.506738281250023 44.16535065311912, 27.515869140625 44.17255280155662, 27.56875 44.195428778119116, 27.607812500000023 44.20534088749412, 27.691650390625 44.20441315311912, 27.732666015625 44.20973541874412, 27.753027343750006 44.21869537968162, 27.78857421875 44.23969147343162, 27.933837890625 44.26593659061912, 27.96728515625 44.280389715619116, 27.993261718750006 44.30426666874412, 28.047949218750006 44.398065496869116, 28.057031250000023 44.40570709843162, 28.098535156250023 44.43024323124412, 28.109960937500006 44.44245026249412, 28.108789062500023 44.45770905155662, 28.101953125000023 44.47833893436912, 28.093164062500023 44.49664948124412, 28.085839843750023 44.504510809369116, 28.066796875000023 44.50702545780662, 28.04248046875 44.51337311405662, 28.020117187500006 44.52216217655662, 28.006933593750006 44.531854559369116, 28.003662109375 44.53974030155662, 28.015039062500023 44.54315827030662, 28.021240234375 44.55231354374412, 28.02109375 44.58783600468162, 28.02783203125 44.59808991093162, 28.03339843750001 44.62164948124412, 28.034423828125 44.63080475468162, 28.030517578125 44.63690827030662, 27.977783203125 44.67914459843162, 27.960058593750006 44.68629791874412, 27.93505859375 44.68891022343162, 27.916113281250006 44.69435455936912, 27.8984375 44.70795319218162, 27.88427734375 44.72589752811912, 27.876708984375 44.74408600468162, 27.88330078125 44.75690338749412, 27.877343750000023 44.76532623905662, 27.86328125 44.76996491093162, 27.845703125 44.77142975468162, 27.828857421875 44.77912018436912, 27.818359375 44.79596588749412, 27.814697265625 44.81276276249412, 27.81875 44.82050202030662, 27.833984375 44.83087799686912, 27.859375 44.85504791874412, 27.878808593750023 44.88209869999412, 27.876708984375 44.90114166874412, 27.889257812500006 44.92621491093162, 27.89423828125001 44.95697662968162, 27.890527343750023 44.98585846561912, 27.876708984375 45.00482819218162, 27.9072265625 45.05316803593162, 27.911376953125 45.06935455936912, 27.917578125 45.08161041874412, 27.944921875 45.11281159061912, 27.951757812500006 45.12836334843162, 27.9501953125 45.13715241093162, 27.941162109375 45.15333893436912, 27.938085937500006 45.16181061405662, 27.938085937500006 45.20656159061912, 27.941650390625 45.224237371869116, 28.00634765625 45.324823309369116, 28.010351562500006 45.33380768436912, 28.01806640625 45.343133856244116, 28.02880859375 45.38746979374412, 28.034423828125 45.40204498905662, 28.048583984375 45.41376373905662, 28.066992187500006 45.42255280155662, 28.087158203125 45.42804596561912, 28.10664062500001 45.42999909061912, 28.127539062500006 45.42677643436912, 28.16953125 45.41498444218162, 28.18515625 45.415643621869116, 28.193603515625 45.42316315311912, 28.20166015625 45.44313385624412, 28.21240234375 45.45045807499412, 28.237060546875 45.45233795780662, 28.266357421875 45.44074127811912, 28.28583984375001 45.421991278119116, 28.28076171875 45.40204498905662, 28.310302734375 45.34808991093162, 28.3296875 45.323114324994116, 28.352636718750006 45.31268952030662, 28.369726562500006 45.30951569218162, 28.404687500000023 45.29535553593162, 28.49365234375 45.27912018436912, 28.576562500000023 45.24835846561912, 28.70947265625 45.22724030155662, 28.746972656250023 45.23073151249412))"^^<http://www.opengis.net/ont/geosparql#wktLiteral>, 0.1, uom:degree))). 
}


# Estrae tutte le narrazioni che intersecano con il poligono del danubio

PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?narra ?nlabel ?c1 ?label ?p1
FROM <urn:x-arq:UnionGraph>
WHERE { 
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
	} 
  	FILTER(geof:sfIntersects(?o1, "MULTILINESTRING ((17.206445312500023 48.06110260624412, 17.242919921875 48.04132721561912, 17.256494140625023 48.02809479374412, 17.26171875 48.00929596561912, 17.272216796875 48.00556061405662, 17.33740234375 47.99896881718162, 17.369042968750023 47.98146393436912, 17.471435546875 47.88910553593162, 17.4814453125 47.882928778119116, 17.49169921875 47.88007233280662, 17.516845703125 47.87653229374412, 17.526123046875 47.87238190311912, 17.559814453125 47.838251043744116, 17.572021484375 47.82977936405662, 17.582421875000023 47.83002350468162, 17.592529296875 47.83344147343162, 17.603759765625 47.83449127811912, 17.618554687500023 47.82953522343162, 17.639404296875 47.819452215619116, 17.657861328125023 47.80756256718162, 17.665771484375 47.79730866093162, 17.676025390625 47.789422918744116, 17.741455078125 47.76564362186912, 17.8251953125 47.75026276249412, 18.112207031250023 47.76271393436912, 18.2353515625 47.75416901249412, 18.2724609375 47.756463934369116, 18.347314453125023 47.776971746869116, 18.552001953125 47.79315827030662, 18.596923828125 47.790887762494116, 18.63330078125 47.78009674686912, 18.6630859375 47.77619049686912, 18.6923828125 47.778192449994116, 18.716699218750023 47.78834869999412, 18.749755859375 47.813836981244116, 18.76708984375 47.82257721561912, 18.789794921875 47.82660553593162, 18.882226562500023 47.82594635624412, 18.898095703125023 47.82379791874412, 18.9111328125 47.81959869999412, 18.915283203125 47.81586334843162, 18.922753906250023 47.80597565311912, 18.927880859375023 47.80280182499412, 18.948486328125 47.803094793744116, 19.013818359375023 47.828973699994116, 19.0390625 47.830438543744116, 19.063232421875 47.82648346561912, 19.0859375 47.81720612186912, 19.106835937500023 47.802850653119116, 19.123046875 47.77545807499412, 19.128320312500023 47.73639557499412, 19.1240234375 47.69342682499412, 19.111962890625023 47.65412018436912, 19.054443359375 47.540399481244116, 19.050537109375 47.50617096561912, 19.0537109375 47.496698309369116, 19.062255859375 47.48541901249412, 19.064208984375 47.47821686405662, 19.062255859375 47.46845123905662, 19.052734375 47.45404694218162, 19.050537109375 47.44782135624412, 19.046777343750023 47.42555573124412, 19.036376953125 47.41254303593162, 19.002099609375023 47.39630768436912, 18.974365234375 47.37946198124412, 18.952539062500023 47.35700104374412, 18.934960937500023 47.328485418744116, 18.920166015625 47.29328034061912, 18.907617187500023 47.23749420780662, 18.886962890625 47.20819733280662, 18.88134765625 47.18964264530662, 18.87890625 47.16901276249412, 18.879150390625 47.14923737186912, 18.88916015625 47.11041901249412, 18.896875 47.09027741093162, 18.903076171875 47.08161041874412, 18.918701171875 47.07404205936912, 18.968017578125 47.03322174686912, 18.966699218750023 47.02374909061912, 18.962060546875023 47.017206121869116, 18.956933593750023 47.01173737186912, 18.954345703125 47.00531647343162, 18.955078125 46.994745184369116, 18.96044921875 46.97748444218162, 18.966943359375023 46.93585846561912, 18.966552734375 46.91730377811912, 18.9580078125 46.909051824994116, 18.948876953125023 46.903924871869116, 18.93896484375 46.89179108280662, 18.930908203125 46.87721588749412, 18.927490234375 46.86500885624412, 18.926025390625 46.83527252811912, 18.927490234375 46.82716705936912, 18.93310546875 46.82057526249412, 18.950585937500023 46.80714752811912, 18.954345703125 46.80353424686912, 18.958398437500023 46.80084869999412, 18.975341796875 46.78400299686912, 18.978515625 46.77997467655662, 18.984765625000023 46.77565338749412, 18.98681640625 46.765497137494116, 18.987548828125 46.75397369999412, 18.989013671875 46.74518463749412, 18.998925781250023 46.72321198124412, 19.001708984375 46.70851471561912, 18.996337890625 46.69489166874412, 18.981591796875023 46.67633698124412, 18.952880859375 46.65619537968162, 18.88525390625 46.63532135624412, 18.858154296875 46.614862371869116, 18.877197265625 46.591180731244116, 18.907617187500023 46.53180573124412, 18.920166015625 46.49884674686912, 18.922753906250023 46.46869537968162, 18.89892578125 46.41437409061912, 18.892236328125023 46.37843659061912, 18.8955078125 46.362909246869116, 18.910058593750023 46.34296295780662, 18.913330078125 46.33063385624412, 18.914941406250023 46.19525787968162, 18.903564453125 46.17304108280662, 18.872314453125 46.183465887494116, 18.8251953125 46.14154694218162, 18.813378906250023 46.12616608280662, 18.794091796875023 46.11671784061912, 18.789794921875 46.11151764530662, 18.78515625 46.11225006718162, 18.775146484375 46.10297272343162, 18.762451171875 46.087274481244116, 18.700341796875023 46.044794012494116, 18.691650390625 46.01850006718162, 18.721582031250023 45.98493073124412, 18.80615234375 45.92360260624412, 18.831445312500023 45.89552643436912, 18.832421875000023 45.89105866093162, 18.83056640625 45.879510809369116, 18.831445312500023 45.87506744999412, 18.835205078125 45.87348053593162, 18.84130859375 45.87396881718162, 18.847412109375 45.873163153119116, 18.851953125000023 45.86818268436912, 18.853906250000023 45.859247137494116, 18.851953125000023 45.83034088749412, 18.849853515625 45.82448151249412, 18.84619140625 45.82025787968162, 18.844482421875 45.81593659061912, 18.84814453125 45.80983307499412, 18.863525390625 45.79877350468162, 18.87060546875 45.79022858280662, 18.899658203125 45.76515534061912, 18.904296875 45.75006744999412, 18.908447265625 45.71967194218162, 18.916748046875 45.70685455936912, 18.930419921875 45.699090887494116, 18.947656250000023 45.69232819218162, 18.962060546875023 45.68329498905662, 18.968017578125 45.66896393436912, 18.96240234375 45.66034577030662, 18.934814453125 45.63361237186912, 18.923828125 45.62799713749412, 18.911865234375 45.61945221561912, 18.90771484375 45.60065338749412, 18.906494140625 45.581903387494116, 18.903076171875 45.57330963749412, 18.911523437500023 45.56842682499412, 18.931542968750023 45.545770574994116, 18.941308593750023 45.53925202030662, 18.959619140625023 45.53937409061912, 18.97265625 45.546502996869116, 18.982666015625 45.55499909061912, 19.000146484375023 45.56146881718162, 19.008691406250023 45.56574127811912, 19.017578125 45.56757233280662, 19.026611328125 45.56281159061912, 19.03271484375 45.55487702030662, 19.035888671875 45.54975006718162, 19.040283203125 45.545282293744116, 19.050537109375 45.53925202030662, 19.067285156250023 45.53363678593162, 19.081787109375 45.53143952030662, 19.094482421875 45.52631256718162, 19.105712890625 45.51190827030662, 19.076562500000023 45.49188873905662, 19.009033203125 45.498895574994116, 18.995849609375 45.47406647343162, 19.00244140625 45.45558502811912, 19.031005859375 45.434198309369116, 19.036767578125023 45.42255280155662, 19.028076171875 45.41242096561912, 18.975341796875 45.39520905155662, 18.98828125 45.37946198124412, 19.003173828125 45.36640045780662, 19.0205078125 45.35748932499412, 19.040185546875023 45.35426666874412, 19.08154296875 45.35426666874412, 19.09130859375 45.35028717655662, 19.0947265625 45.34076569218162, 19.095703125 45.32941315311912, 19.098291015625023 45.32013580936912, 19.124267578125 45.29840729374412, 19.161523437500023 45.285272528119116, 19.362695312500023 45.24848053593162, 19.40673828125 45.24896881718162, 19.490869140625023 45.264276434369116, 19.529541015625 45.26686432499412, 19.5576171875 45.25580475468162, 19.571679687500023 45.23659088749412, 19.580468750000023 45.23078034061912, 19.598535156250023 45.22785065311912, 19.658105468750023 45.23444244999412, 19.698486328125 45.246698309369116, 19.741943359375 45.24506256718162, 19.784912109375 45.23749420780662, 19.810791015625 45.22785065311912, 19.817041015625023 45.23170807499412, 19.831689453125023 45.238153387494116, 19.838134765625 45.24213287968162, 19.846582031250023 45.25055573124412, 19.855615234375023 45.26508209843162, 19.862451171875023 45.272821356244116, 19.880859375 45.28229401249412, 19.898583984375023 45.27936432499412, 19.914306640625 45.268915106244116, 19.927490234375 45.25580475468162, 19.949365234375023 45.21869537968162, 19.965576171875 45.19855377811912, 19.985595703125 45.18976471561912, 20.042382812500023 45.17775299686912, 20.064697265625 45.17548248905662, 20.184960937500023 45.18500397343162, 20.222412109375 45.17548248905662, 20.256982421875023 45.15675690311912, 20.289453125000023 45.13226959843162, 20.345849609375023 45.07306549686912, 20.35693359375 45.03449127811912, 20.333251953125 45.01056549686912, 20.303955078125 44.99396393436912, 20.298095703125 44.97748444218162, 20.290673828125023 44.97748444218162, 20.30322265625 44.95465729374412, 20.31884765625 44.93439362186912, 20.396875 44.86456940311912, 20.408447265625 44.857049871869116, 20.455078125 44.84027741093162, 20.51416015625 44.83685944218162, 20.5458984375 44.83978912968162, 20.580322265625 44.85736725468162, 20.594970703125 44.85797760624412, 20.623681640625023 44.854608465619116, 20.636376953125023 44.84943268436912, 20.638574218750023 44.83734772343162, 20.628173828125 44.78859284061912, 20.6279296875 44.77704498905662, 20.63330078125 44.76520416874412, 20.644433593750023 44.75580475468162, 20.671875 44.74396393436912, 20.684814453125 44.733514715619116, 20.720361328125023 44.69623444218162, 20.741943359375 44.67921784061912, 20.763671875 44.66840241093162, 20.826416015625 44.66095612186912, 20.883203125000023 44.67267487186912, 20.989501953125 44.71681549686912, 21.077783203125023 44.72650787968162, 21.102783203125 44.74066803593162, 21.112207031250023 44.74481842655662, 21.125634765625023 44.74562409061912, 21.15087890625 44.74408600468162, 21.163818359375 44.74787018436912, 21.172265625000023 44.75690338749412, 21.179443359375 44.76808502811912, 21.188867187500023 44.77826569218162, 21.222412109375 44.79669830936912, 21.269433593750023 44.81366608280662, 21.319091796875 44.825067449994116, 21.360107421875 44.82667877811912, 21.3779296875 44.81691315311912, 21.395263671875 44.79047272343162, 21.41162109375 44.78510162968162, 21.49658203125 44.77826569218162, 21.557861328125 44.781854559369116, 21.577539062500023 44.77789948124412, 21.594970703125 44.76618073124412, 21.603662109375023 44.75031159061912, 21.609765625000023 44.73219635624412, 21.619140625 44.71417877811912, 21.655664062500023 44.68793366093162, 21.70458984375 44.67726471561912, 21.75625 44.67750885624412, 21.801171875000023 44.68414948124412, 21.837792968750023 44.695428778119116, 21.85498046875 44.69874909061912, 21.871484375000023 44.69623444218162, 21.961816406250023 44.66254303593162, 21.993798828125023 44.658807684369116, 22.003808593750023 44.651727606244116, 22.031640625000023 44.60358307499412, 22.039306640625 44.57709381718162, 22.044677734375 44.56940338749412, 22.05517578125 44.562372137494116, 22.066552734375023 44.557489324994116, 22.07568359375 44.55097077030662, 22.08642578125 44.52204010624412, 22.103759765625 44.509881903119116, 22.126123046875023 44.50294830936912, 22.147705078125 44.50116608280662, 22.171630859375 44.50563385624412, 22.1845703125 44.51539948124412, 22.298486328125023 44.66193268436912, 22.304443359375 44.677606512494116, 22.319238281250023 44.68561432499412, 22.360595703125 44.69232819218162, 22.380029296875023 44.70075104374412, 22.414941406250023 44.72809479374412, 22.425537109375 44.73390534061912, 22.450097656250023 44.73322174686912, 22.468408203125023 44.73041412968162, 22.483154296875 44.724237371869116, 22.552734375 44.66945221561912, 22.5869140625 44.64960358280662, 22.62060546875 44.63771393436912, 22.699462890625 44.63087799686912, 22.714257812500023 44.62335846561912, 22.764794921875023 44.58307526249412, 22.7587890625 44.56488678593162, 22.741113281250023 44.552118231244116, 22.718896484375023 44.54462311405662, 22.699462890625 44.542108465619116, 22.677978515625 44.54572174686912, 22.641503906250023 44.56329987186912, 22.62060546875 44.56940338749412, 22.599755859375023 44.57008698124412, 22.579833984375 44.56574127811912, 22.565087890625023 44.55573151249412, 22.559326171875 44.53900787968162, 22.55615234375 44.52167389530662, 22.5478515625 44.51198151249412, 22.534912109375 44.50775787968162, 22.499902343750023 44.50665924686912, 22.490478515625 44.50446198124412, 22.483544921875023 44.50001862186912, 22.479248046875 44.49066803593162, 22.4765625 44.47724030155662, 22.476464843750023 44.46417877811912, 22.4794921875 44.45607330936912, 22.50048828125 44.44215729374412, 22.5048828125 44.43524811405662, 22.505859375 44.42780182499412, 22.50341796875 44.41193268436912, 22.504638671875 44.40431549686912, 22.522216796875 44.37531159061912, 22.548730468750023 44.349237371869116, 22.582275390625 44.32868073124412, 22.62060546875 44.31622955936912, 22.662011718750023 44.31195709843162, 22.681054687500023 44.305536199994116, 22.68896484375 44.29193756718162, 22.684716796875023 44.24391510624412, 22.690087890625023 44.22919342655662, 22.905908203125023 44.12311432499412, 22.942138671875 44.11176178593162, 22.987548828125 44.10724518436912, 23.030517578125 44.09332916874412, 23.03955078125 44.062616278119116, 23.0224609375 44.031854559369116, 22.987548828125 44.01788971561912, 22.965722656250023 44.015741278119116, 22.926025390625 44.00641510624412, 22.9052734375 44.00421784061912, 22.885400390625023 43.994745184369116, 22.874169921875023 43.972284246869116, 22.85 43.89723541874412, 22.850488281250023 43.87457916874412, 22.862939453125023 43.85565827030662, 22.88818359375 43.83978912968162, 22.919091796875023 43.83449127811912, 23.13134765625 43.84821198124412, 23.161376953125 43.85761139530662, 23.196435546875023 43.86298248905662, 23.23388671875 43.87750885624412, 23.326416015625 43.88703034061912, 23.319580078125 43.88703034061912, 23.484130859375 43.88080475468162, 23.592041015625 43.83766510624412, 23.635498046875 43.832391668744116, 23.72021484375 43.846063543744116, 23.7421875 43.84296295780662, 23.799462890625023 43.818719793744116, 24.158837890625023 43.75319244999412, 24.357666015625 43.76027252811912, 24.374902343750023 43.76410553593162, 24.430566406250023 43.79437897343162, 24.465722656250023 43.80267975468162, 24.499658203125023 43.79975006718162, 24.705078125 43.74396393436912, 24.752099609375023 43.73908112186912, 24.963134765625 43.749872137494116, 25.0810546875 43.71918366093162, 25.210693359375 43.71210358280662, 25.251855468750023 43.70490143436912, 25.288183593750006 43.68927643436912, 25.322363281250006 43.66994049686912, 25.358984375 43.65448639530662, 25.402587890625 43.65033600468162, 25.425390625 43.65460846561912, 25.466894531250006 43.66798737186912, 25.48828125 43.670770574994116, 25.533300781250006 43.66896393436912, 25.556054687500023 43.67067291874412, 25.574609375000023 43.677606512494116, 25.593359375 43.68092682499412, 25.615966796875 43.68800690311912, 25.637451171875 43.69757721561912, 25.653076171875 43.70831940311912, 25.6708984375 43.71759674686912, 25.739013671875 43.71918366093162, 25.780517578125 43.73224518436912, 25.803955078125 43.76019928593162, 25.805761718750006 43.76393463749412, 25.838769531250023 43.78864166874412, 25.86875 43.801141668744116, 25.916015625 43.844598699994116, 25.924072265625 43.85890534061912, 25.933496093750023 43.87055084843162, 26.0537109375 43.93458893436912, 26.061132812500006 43.95001862186912, 26.078857421875 43.96925690311912, 26.11572265625 43.99909088749412, 26.150146484375 44.01271393436912, 26.230859375000023 44.02777741093162, 26.309960937500023 44.052850653119116, 26.613671875000023 44.08515045780662, 26.647216796875 44.093622137494116, 26.667236328125 44.095331121869116, 26.676855468750006 44.09735748905662, 26.69677734375 44.106317449994116, 26.708251953125 44.10834381718162, 26.753173828125 44.10834381718162, 26.788964843750023 44.11622955936912, 26.883544921875 44.15680573124412, 27.001074218750006 44.16535065311912, 27.026953125 44.17731354374412, 27.099609375 44.14472077030662, 27.204980468750023 44.12946198124412, 27.226171875 44.12091705936912, 27.2666015625 44.13776276249412, 27.292236328125 44.15143463749412, 27.444726562500023 44.13397858280662, 27.461035156250006 44.13764069218162, 27.48164062500001 44.14569733280662, 27.499267578125 44.15578034061912, 27.506738281250023 44.16535065311912, 27.515869140625 44.17255280155662, 27.56875 44.195428778119116, 27.607812500000023 44.20534088749412, 27.691650390625 44.20441315311912, 27.732666015625 44.20973541874412, 27.753027343750006 44.21869537968162, 27.78857421875 44.23969147343162, 27.933837890625 44.26593659061912, 27.96728515625 44.280389715619116, 27.993261718750006 44.30426666874412, 28.047949218750006 44.398065496869116, 28.057031250000023 44.40570709843162, 28.098535156250023 44.43024323124412, 28.109960937500006 44.44245026249412, 28.108789062500023 44.45770905155662, 28.101953125000023 44.47833893436912, 28.093164062500023 44.49664948124412, 28.085839843750023 44.504510809369116, 28.066796875000023 44.50702545780662, 28.04248046875 44.51337311405662, 28.020117187500006 44.52216217655662, 28.006933593750006 44.531854559369116, 28.003662109375 44.53974030155662, 28.015039062500023 44.54315827030662, 28.021240234375 44.55231354374412, 28.02109375 44.58783600468162, 28.02783203125 44.59808991093162, 28.03339843750001 44.62164948124412, 28.034423828125 44.63080475468162, 28.030517578125 44.63690827030662, 27.977783203125 44.67914459843162, 27.960058593750006 44.68629791874412, 27.93505859375 44.68891022343162, 27.916113281250006 44.69435455936912, 27.8984375 44.70795319218162, 27.88427734375 44.72589752811912, 27.876708984375 44.74408600468162, 27.88330078125 44.75690338749412, 27.877343750000023 44.76532623905662, 27.86328125 44.76996491093162, 27.845703125 44.77142975468162, 27.828857421875 44.77912018436912, 27.818359375 44.79596588749412, 27.814697265625 44.81276276249412, 27.81875 44.82050202030662, 27.833984375 44.83087799686912, 27.859375 44.85504791874412, 27.878808593750023 44.88209869999412, 27.876708984375 44.90114166874412, 27.889257812500006 44.92621491093162, 27.89423828125001 44.95697662968162, 27.890527343750023 44.98585846561912, 27.876708984375 45.00482819218162, 27.9072265625 45.05316803593162, 27.911376953125 45.06935455936912, 27.917578125 45.08161041874412, 27.944921875 45.11281159061912, 27.951757812500006 45.12836334843162, 27.9501953125 45.13715241093162, 27.941162109375 45.15333893436912, 27.938085937500006 45.16181061405662, 27.938085937500006 45.20656159061912, 27.941650390625 45.224237371869116, 28.00634765625 45.324823309369116, 28.010351562500006 45.33380768436912, 28.01806640625 45.343133856244116, 28.02880859375 45.38746979374412, 28.034423828125 45.40204498905662, 28.048583984375 45.41376373905662, 28.066992187500006 45.42255280155662, 28.087158203125 45.42804596561912, 28.10664062500001 45.42999909061912, 28.127539062500006 45.42677643436912, 28.16953125 45.41498444218162, 28.18515625 45.415643621869116, 28.193603515625 45.42316315311912, 28.20166015625 45.44313385624412, 28.21240234375 45.45045807499412, 28.237060546875 45.45233795780662, 28.266357421875 45.44074127811912, 28.28583984375001 45.421991278119116, 28.28076171875 45.40204498905662, 28.310302734375 45.34808991093162, 28.3296875 45.323114324994116, 28.352636718750006 45.31268952030662, 28.369726562500006 45.30951569218162, 28.404687500000023 45.29535553593162, 28.49365234375 45.27912018436912, 28.576562500000023 45.24835846561912, 28.70947265625 45.22724030155662, 28.746972656250023 45.23073151249412))"^^<http://www.opengis.net/ont/geosparql#wktLiteral>)). 
}

#Le narrazioni vicino a tutti i fiumi italiani 944.515 s
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>
PREFIX wd: <http://www.wikidata.org/entity/>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX wdt: <http://www.wikidata.org/prop/direct/>
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>

SELECT ?nlabel ?label ?river_name
FROM <urn:x-arq:UnionGraph>
WHERE { 
		
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
   

{
SELECT ?river_osm ?river_wd ?river_name ?length ?geometry WHERE {
      SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> {
  ?river_osm osmkey:waterway ?waterway .
  ?river_osm geo:hasGeometry ?geometry .
  ?river_osm osmkey:name ?river_name .
  ?river_osm osm:wikidata ?river_wd .
  SERVICE <https://qlever.cs.uni-freiburg.de/api/wikidata> {
    ?river_wd wdt:P31/wdt:P279* wd:Q4022 .
    ?river_wd wdt:P17 wd:Q38 .
    ?river_wd wdt:P2043 ?length FILTER (?length > 100)
  }
}
  }
  }

  	FILTER(geof:sfIntersects(?o1, geof:buffer(?geometry, 0.1, uom:degree))). 
}

PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX osmrel: <https://www.openstreetmap.org/relation/>
PREFIX schema: <http://schema.org/>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT * 
FROM <urn:x-arq:UnionGraph>
WHERE  
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
  	FILTER(geof:sfWithin(?o1,?hasgeometry)). 
  	{SELECT ?hasgeometry WHERE {
  	 SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> { 
      ?osm_id osm:wikidata wd:Q1286 .
      ?osm_id geo:hasGeometry ?hasgeometry .
      ?osm_id a <https://www.openstreetmap.org/relation> .
        filter(regex(?hasgeometry, "MULTIPOLYGON", "i" ))
      } }LIMIT 1 }
}

PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX osmrel: <https://www.openstreetmap.org/relation/>
PREFIX schema: <http://schema.org/>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT * 
FROM <urn:x-arq:UnionGraph>
WHERE  
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
  	FILTER(geof:sfWithin(?o1,?hasgeometry)). 
  	{SELECT ?hasgeometry WHERE {
  	 SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> { 
      ?osm_id osm:wikidata wd:Q12431 .
      ?osm_id geo:hasGeometry ?hasgeometry .
        filter(regex(?hasgeometry, "MULTIPOLYGON", "i" ))
      } } LIMIT 1}
}

PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/> 
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX narra: <https://dlnarratives.eu/ontology#>
PREFIX osm: <https://www.openstreetmap.org/>
PREFIX osmrel: <https://www.openstreetmap.org/relation/>
PREFIX schema: <http://schema.org/>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT * 
FROM <urn:x-arq:UnionGraph>
WHERE  
	{	
    	?narra narra:isAboutCountry ?c1 .
    	?narra rdfs:label ?nlabel .
    	?c1 rdfs:label ?label .
    	?narra narra:isAboutLAU ?p1 .
    	?p1 geo:hasGeometry ?g1 .
		?g1 geo:asWKT ?o1 .
  	FILTER(geof:sfWithin(?o1, geof:buffer(?hasgeometry, 0.5, uom:degree))). 
  {SELECT ?hasgeometry WHERE {
   SERVICE <https://qlever.cs.uni-freiburg.de/api/osm-planet> { 
      ?osm_id osm:wikidata wd:Q2807 .
      ?osm_id geo:hasGeometry ?hasgeometry .
          filter(regex(?hasgeometry, "POINT", "i" ))
      } }LIMIT 1}
}